[
  {
    "Title":"Python Developer -ENG - Infosys@ PAN India",
    "Company":"Infosys",
    "Experience":"3 - 8 years",
    "Salary":"Not Disclosed",
    "Location":"Hyderabad,Chennai,Bengaluru",
    "Education":"EducationUG:BCA in Any Specialization, B.Tech\/B.E. in Any Specialization, B.Sc in Any Specialization",
    "Star_Skills":[
      "Django",
      "Python Development",
      "Python"
    ],
    "Normal_Skills":[
      "Django Framework"
    ],
    "Posted_Date":"2 days ago",
    "Last_Apply_Date":"10 Sep 2025",
    "Role":"Software Development - Other ,",
    "Industry Type":"IT Services & Consulting ,",
    "Department":"Engineering - Software & QA ,",
    "Employment Type":"Full Time, Permanent",
    "Role Category":"Software Development",
    "Description":"Responsibilities A day in the life of an Infoscion •\tAs part of the Infosys delivery team, your primary role would be to ensure effective Design, Development, Validation and Support activities, to assure that our clients are satisfied with the high levels of service in the technology domain. •\tYou will gather the requirements and specifications to understand the client requirements in a detailed manner and translate the same into system requirements. •\tYou will play a key role in the overall estimation of work requirements to provide the right information on project estimations to Technology Leads and Project Managers. •\tYou would be a key contributor to building efficient programs\/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Technical and Professional Requirements: •\tPrimary skills:Technology->Machine Learning->Python Preferred Skills: Technology->Machine Learning->Python Additional Responsibilities: •\tKnowledge of design principles and fundamentals of architecture •\tUnderstanding of performance engineering •\tKnowledge of quality processes and estimation techniques •\tBasic understanding of project domain •\tAbility to translate functional \/ nonfunctional requirements to systems requirements •\tAbility to design and code complex programs •\tAbility to write test cases and scenarios based on the specifications •\tGood understanding of SDLC and agile methodologies  •\tAwareness of latest technologies and trends •\tLogical thinking and problem solving skills along with an ability to collaborate Educational Requirements MCA,MSc,MTech,Bachelor of Engineering,BCA,BSc,BTech responsibilities",
    "Job_URL":"https:\/\/www.naukri.com\/job-listings-python-developer-eng-infosys-pan-india-infosys-hyderabad-chennai-bengaluru-3-to-8-years-090625015061",
    "Scraped_At":"2025-11-21T09:24:43.020570",
    "Job_Type":"python-developer"
  },
  {
    "Title":"Python Software Developer- Bangalore (Pan India Infosys)",
    "Company":"Infosys",
    "Experience":"4 - 6 years",
    "Salary":"Not Disclosed",
    "Location":"Hyderabad,Chennai,Bengaluru",
    "Education":"EducationUG:B.Sc in Any Specialization, BCA in Any Specialization, B.Tech\/B.E. in Any SpecializationPG:MS\/M.Sc(Science) in Any Specialization, M.Tech in Any Specialization, MCA in Any Specialization",
    "Star_Skills":[
      "Python"
    ],
    "Normal_Skills":[
      "Docker",
      "Shell Scripting",
      "Django",
      "Machine Learning",
      "Flask"
    ],
    "Posted_Date":"1 day ago",
    "Last_Apply_Date":"16 Oct 2024",
    "Role":"Software Development - Other ,",
    "Industry Type":"IT Services & Consulting ,",
    "Department":"Engineering - Software & QA ,",
    "Employment Type":"Full Time, Permanent",
    "Role Category":"Software Development",
    "Description":"Job description Hiring for Python developer with experience range 4 years & above Mandatory Skills:  Python, django, flask etc., Education: BE\/B.Tech\/MCA\/M.Tech\/MSc.\/MS Responsibilities A day in the life of an Infoscion As part of the Infosys consulting team, your primary role would be to actively aid the consulting team in different phases of the project including problem definition, effort estimation, diagnosis, solution generation and design and deployment You will explore the alternatives to the recommended solutions based on research that includes literature surveys, information available in public domains, vendor evaluation information, etc. and build POCs You will create requirement specifications from the business needs, define the to-be-processes and detailed functional designs based on requirements. You will support configuring solution requirements on the products; understand if any issues, diagnose the root-cause of such issues, seek clarifications, and then identify and shortlist solution alternatives You will also contribute to unit-level and organizational initiatives with an objective of providing high quality value adding solutions to customers. If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you!",
    "Job_URL":"https:\/\/www.naukri.com\/job-listings-python-software-developer-bangalore-pan-india-infosys-infosys-hyderabad-chennai-bengaluru-4-to-6-years-141125032331",
    "Scraped_At":"2025-11-21T09:24:45.179213",
    "Job_Type":"python-developer"
  },
  {
    "Title":"Python Developer-Pan India(A)",
    "Company":"Infosys",
    "Experience":"5 - 10 years",
    "Salary":"Not Disclosed",
    "Location":"Hyderabad,Chennai,Bengaluru",
    "Education":"EducationUG:BCA in Any Specialization, B.Tech\/B.E. in Any Specialization, B.Sc in Any SpecializationPG:MCA in Any Specialization, M.Tech in Any Specialization, MS\/M.Sc(Science) in Any Specialization",
    "Star_Skills":[
      "Python Development",
      "Python"
    ],
    "Normal_Skills":[
      "Python Framework",
      "Django",
      "Flask"
    ],
    "Posted_Date":"3 days ago",
    "Last_Apply_Date":"10 Sep 2025",
    "Role":"Software Development - Other ,",
    "Industry Type":"IT Services & Consulting ,",
    "Department":"Engineering - Software & QA ,",
    "Employment Type":"Full Time, Permanent",
    "Role Category":"Software Development",
    "Description":"Role- Python developer Experience-5-10 years Location- Pan India We are seeking a highly skilled and experienced Python Developer to join our growing team. The ideal candidate should have strong expertise in Python , with hands-on experience in Django and Flask frameworks. You will be responsible for developing robust backend systems, RESTful APIs, and scalable web applications. Key Responsibilities: Design, develop, and maintain backend services and APIs using Python, Django, and Flask. Collaborate with front-end developers, DevOps, and product teams to deliver high-quality software solutions. Write clean, maintainable, and efficient code following best practices. Optimize applications for maximum speed and scalability. Troubleshoot and debug issues across the application stack. Participate in code reviews and contribute to continuous improvement.",
    "Job_URL":"https:\/\/www.naukri.com\/job-listings-python-developer-pan-india-a-infosys-hyderabad-chennai-bengaluru-5-to-10-years-300925028098",
    "Scraped_At":"2025-11-21T09:24:47.092206",
    "Job_Type":"python-developer"
  },
  {
    "Title":"Python developer @Infosys",
    "Company":"Infosys",
    "Experience":"5 - 9 years",
    "Salary":"Not Disclosed",
    "Location":"Hyderabad,Pune,Bengaluru",
    "Education":"EducationUG:B.Sc in Any Specialization, BCA in Any Specialization, B.Tech\/B.E. in Any SpecializationPG:M.Tech in Any Specialization, MCA in Any Specialization, MS\/M.Sc(Science) in Any Specialization",
    "Star_Skills":[
      "Python Development"
    ],
    "Normal_Skills":[
      "Django",
      "Django Framework",
      "Flask"
    ],
    "Posted_Date":"6 days ago",
    "Last_Apply_Date":"NA",
    "Role":"Back End Developer ,",
    "Industry Type":"IT Services & Consulting ,",
    "Department":"Engineering - Software & QA ,",
    "Employment Type":"Full Time, Permanent",
    "Role Category":"Software Development",
    "Description":"Job description, Hiring for Python developer with experience range 5-10 years Mandatory Skills: Python developer Education: BE\/B.Tech\/MCA\/M.Tech\/MSc.\/MS Responsibilities A day in the life of an Infoscion As part of the Infosys consulting team, your primary role would be to actively aid the consulting team in different phases of the project including problem definition, effort estimation, diagnosis, solution generation and design and deployment You will explore the alternatives to the recommended solutions based on research that includes literature surveys, information available in public domains, vendor evaluation information, etc. and build POCs You will create requirement specifications from the business needs, define the to-be-processes and detailed functional designs based on requirements. You will support configuring solution requirements on the products; understand if any issues, diagnose the root-cause of such issues, seek clarifications, and then identify and shortlist solution alternatives You will also contribute to unit-level and organizational initiatives with an objective of providing high quality value adding solutions to customers. If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you!",
    "Job_URL":"https:\/\/www.naukri.com\/job-listings-python-developer-infosys-infosys-hyderabad-pune-bengaluru-5-to-9-years-141125007891",
    "Scraped_At":"2025-11-21T09:24:49.629831",
    "Job_Type":"python-developer"
  },
  {
    "Title":"Python Software Developer",
    "Company":"ti Steps",
    "Experience":"0 - 1 years",
    "Salary":"3.5-6.5 Lacs P.A.",
    "Location":"Hyderabad,Chennai,Bengaluru",
    "Education":"EducationUG:Any Graduate",
    "Star_Skills":[
      "Python Development",
      "Python"
    ],
    "Normal_Skills":[
      "Pandas",
      "Web Scraping",
      "Numpy",
      "SQL"
    ],
    "Posted_Date":"3 days ago",
    "Last_Apply_Date":"NA",
    "Role":"Full Stack Developer ,",
    "Industry Type":"IT Services & Consulting ,",
    "Department":"Engineering - Software & QA ,",
    "Employment Type":"Full Time, Permanent",
    "Role Category":"Software Development",
    "Description":"About the Role We are looking for a detail-oriented Quality Analyst (QA) to ensure the delivery of high-quality software products. You will be responsible for creating test plans, executing manual\/automated tests, identifying bugs, and collaborating with development teams to ensure smooth and bug-free releases. Key Responsibilities Develop and execute test plans, test cases, and test scripts . Perform manual testing (functional, regression, integration, UAT) across web\/mobile applications. Identify, document, and track defects using tools like Jira, Bugzilla, or Azure DevOps . Collaborate with developers and product teams to diagnose and resolve issues. Validate new features and enhancements before release. Perform smoke testing, sanity testing, and regression testing . Ensure application quality through cross-browser, cross-platform, and device testing. Prepare and maintain detailed test reports and documentation. Assist in developing automation test scripts (if applicable). Required Skills & Qualifications Strong understanding of software testing methodologies (SDLC, STLC). Experience with manual testing of web and\/or mobile applications. Knowledge of test case design techniques and defect lifecycle. Familiarity with testing tools like Jira, TestRail, Postman, Selenium (optional) . Basic understanding of APIs and ability to perform API testing. Good analytical and problem-solving skills. Attention to detail and ability to think from an end-user perspective. Strong communication and collaboration skills. Preferred \/ Nice-to-Have Skills Experience with automation testing (Selenium, Appium, Cypress, Playwright). Knowledge of performance testing tools (JMeter, LoadRunner). Understanding of SQL for basic database validation. Experience in Agile\/Scrum environments. Familiarity with CI\/CD pipelines and version control (Git). Education Bachelors degree in Computer Science, IT, Engineering, or related field (or equivalent experience)",
    "Job_URL":"https:\/\/www.naukri.com\/job-listings-python-software-developer-ti-steps-hyderabad-chennai-bengaluru-0-to-1-years-171125011141",
    "Scraped_At":"2025-11-21T09:24:54.496738",
    "Job_Type":"python-developer"
  },
  {
    "Title":"Python Developer",
    "Company":"PwC India",
    "Experience":"6 - 11 years",
    "Salary":"Not Disclosed",
    "Location":"Bengaluru",
    "Education":"EducationUG:B.Tech\/B.E. in Any SpecializationPG:MCA in Any Specialization, MBA\/PGDM in Any Specialization, M.Tech in Any Specialization",
    "Star_Skills":[
      "Python Development",
      "Python"
    ],
    "Normal_Skills":[
      "Troubleshooting"
    ],
    "Posted_Date":"1 week ago",
    "Last_Apply_Date":"NA",
    "Role":"Data Engineer ,",
    "Industry Type":"IT Services & Consulting ,",
    "Department":"Engineering - Software & QA ,",
    "Employment Type":"Full Time, Permanent",
    "Role Category":"Software Development",
    "Description":"Job Description: Python Developer (Manager Level) Job Description We are seeking experienced Python Developers with strong expertise to join our team in a Managerial capacity. This is a full-time, onsite role where you will work closely with a dynamic team to deliver high-quality solutions. The position requires candidates with a proven background in Python development and leadership capabilities within software development projects. Key Responsibilities Lead and manage a team of developers to ensure project deliverables are met within deadlines. Design, develop, and maintain Python-based applications and systems. Collaborate with cross-functional teams to gather and analyze requirements. Ensure code quality, adherence to coding standards, and implement best practices. Troubleshoot and resolve complex technical issues. Mentor and guide team members to enhance their technical skills and career growth. Job Description: Python Developer technologies in Python development.",
    "Job_URL":"https:\/\/www.naukri.com\/job-listings-python-developer-pwc-india-bengaluru-6-to-11-years-121125035194",
    "Scraped_At":"2025-11-21T09:24:55.701724",
    "Job_Type":"python-developer"
  },
  {
    "Title":"Python Developer",
    "Company":"Infosys",
    "Experience":"5 - 10 years",
    "Salary":"Not Disclosed",
    "Location":"Pune,Chennai,Bengaluru",
    "Education":"EducationUG:B.Tech\/B.E. in Any SpecializationPG:MCA in Any Specialization, M.Tech in Any Specialization",
    "Star_Skills":[
      "Python"
    ],
    "Normal_Skills":[
      "Django",
      "Pandas",
      "cloud platforms",
      "NumPy",
      "Flask",
      "Rest APIs"
    ],
    "Posted_Date":"6 days ago",
    "Last_Apply_Date":"NA",
    "Role":"Full Stack Developer ,",
    "Industry Type":"IT Services & Consulting ,",
    "Department":"Engineering - Software & QA ,",
    "Employment Type":"Full Time, Permanent",
    "Role Category":"Software Development",
    "Description":"Looking for Python Developer. Create scalable, efficient solutions using Python, Django\/Flask, and libraries like Pandas, NumPy. Experience with REST APIs, cloud platforms (AWS\/GCP), and scripting is a plus. Tackle real-world challenges in Agile teams, from data processing to backend development. Join Infosys, renowned for innovation, and grow your career in a supportive environment Locatoin : Bengaluru,Pune,Chennai,Hyderabad",
    "Job_URL":"https:\/\/www.naukri.com\/job-listings-python-developer-infosys-pune-chennai-bengaluru-5-to-10-years-050325926771",
    "Scraped_At":"2025-11-21T09:24:57.141678",
    "Job_Type":"python-developer"
  },
  {
    "Title":"Python Developer",
    "Company":"Infosys",
    "Experience":"5 - 10 years",
    "Salary":"Not Disclosed",
    "Location":"Pune,Chennai,Bengaluru",
    "Education":"EducationUG:B.Tech\/B.E. in Any Specialization",
    "Star_Skills":[
      "Python Development"
    ],
    "Normal_Skills":[
      "Core Python",
      "Django",
      "Django Framework",
      "Python",
      "Flask"
    ],
    "Posted_Date":"1 week ago",
    "Last_Apply_Date":"10 Sep 2025",
    "Role":"Software Development - Other ,",
    "Industry Type":"IT Services & Consulting ,",
    "Department":"Engineering - Software & QA ,",
    "Employment Type":"Full Time, Permanent",
    "Role Category":"Software Development",
    "Description":"Job Summary: We are looking for a talented Python Developer with strong experience in Core Python and frameworks like Django and Flask . The ideal candidate will be responsible for building scalable web applications, developing APIs, and ensuring high performance and responsiveness. Key Responsibilities: Design, develop, and maintain web applications using Python , Django , and Flask . Build and integrate RESTful APIs for backend services. Write clean, efficient, and reusable code following best practices. Collaborate with front-end developers and other team members to deliver complete solutions. Optimize applications for performance, scalability, and security . Perform unit testing, debugging , and participate in code reviews. Stay updated with emerging Python technologies and frameworks. Required Skills & Qualifications: Strong proficiency in Core Python . Hands-on experience with Django and Flask frameworks . Knowledge of ORMs (Django ORM, SQLAlchemy). Familiarity with RESTful API development . Experience with databases (PostgreSQL, MySQL, MongoDB). Understanding of Git and version control systems. Basic knowledge of HTML, CSS, and JavaScript for integration. Preferred Qualifications: Exposure to cloud platforms (AWS, Azure, GCP). Experience with Docker and containerized deployments. Familiarity with CI\/CD pipelines . Soft Skills: Strong problem-solving and analytical skills. Excellent communication and collaboration abilities. Ability to work in an Agile environment.",
    "Job_URL":"https:\/\/www.naukri.com\/job-listings-python-developer-infosys-pune-chennai-bengaluru-5-to-10-years-221025000186",
    "Scraped_At":"2025-11-21T09:24:59.045041",
    "Job_Type":"python-developer"
  },
  {
    "Title":"Urgent hiring For Python Developer",
    "Company":"Tekdoors",
    "Experience":"3 - 7 years",
    "Salary":"10-20 Lacs P.A.",
    "Location":"Pune,Bengaluru,Delhi \/ NCR",
    "Education":"EducationUG:Any Graduate",
    "Star_Skills":[
      "Django",
      "Fast Api",
      "Python",
      "Flask"
    ],
    "Normal_Skills":[

    ],
    "Posted_Date":"2 days ago",
    "Last_Apply_Date":"NA",
    "Role":"Back End Developer ,",
    "Industry Type":"IT Services & Consulting ,",
    "Department":"Engineering - Software & QA ,",
    "Employment Type":"Full Time, Permanent",
    "Role Category":"Software Development",
    "Description":"Role & responsibilities Mandatory Skills: 1. Very strong in Python programming, developing REST API (using FastAPI, Django, Flask or other libraries) and integration with other web services. 2. Integration experience with data sources like REST web services, Kafka, Oracle, third party systems like Workday, etc. 3. Ability to implement best practices handling modularity, security and scalability in the Python applications 4. Experience in SQL 5. Experience in Azure cloud services for developing\/deploying\/securing Python app (REST API). 6. Ability to implement workflow rules using rules engine like Temporal or Azure logic app or python libraries. 7. Good to have exposure in deployment of python app on Kubernetes. 8. Excellent written & spoken communication skills, ability to interact with customer & relevant stakeholders. 9. Ability to understand the provided requirements, ability to assist in architecting solutions and ability to translate it into the implementation, following best practices. 10. Proactive, Self-driven, motivated, result oriented, ability to take ownership and excellent learning attitude. 11. Experience in working with complex enterprise client ecosystem. Roles & Responsibilities About the Team: - You will be part of a dynamic and agile team that values innovation and creativity in software development. - The team comprises experienced developers, testers, and project managers committed to delivering excellence in every project. - A collaborative atmosphere encourages knowledge sharing and continuous learning among team members. You are Responsible for: -  development, and deployment of applications using Python and Fast API. - ensuring code reviews, and best practices are followed - Ensuring timely delivery of projects while maintaining high standards of code quality and performance. To succeed in this role  you should have the following: - Strong experience in Python development, particularly with Fast API and web frameworks. - Proven leadership skills and experience in mentoring junior developers. - Excellent problem-solving abilities and a strong understanding of software development methodologies. --",
    "Job_URL":"https:\/\/www.naukri.com\/job-listings-urgent-hiring-for-python-developer-tekdoors-pune-bengaluru-delhi-ncr-3-to-7-years-181125037622",
    "Scraped_At":"2025-11-21T09:25:00.300572",
    "Job_Type":"python-developer"
  }
]